{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.10.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "vgg_like_in/168_60_1_out/24_filters/16_pool_shape/2_2_max/True_filter_shapes/5_1_3_1_dropout/0.3", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 168, null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_126"}, "name": "input_126", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv0", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv0", "inbound_nodes": [[["input_126", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN0", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN0", "inbound_nodes": [[["Conv0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1", "inbound_nodes": [[["BN0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1", "inbound_nodes": [[["Conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2D1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "MaxPool2D1", "inbound_nodes": [[["BN1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_750", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_750", "inbound_nodes": [[["MaxPool2D1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2", "inbound_nodes": [[["dropout_750", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2", "inbound_nodes": [[["Conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv3", "inbound_nodes": [[["BN2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN3", "inbound_nodes": [[["Conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2D2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "MaxPool2D2", "inbound_nodes": [[["BN3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_751", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_751", "inbound_nodes": [[["MaxPool2D2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv4", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv4", "inbound_nodes": [[["dropout_751", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN4", "inbound_nodes": [[["Conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv5", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv5", "inbound_nodes": [[["BN4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN5", "inbound_nodes": [[["Conv5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2D3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "MaxPool2D3", "inbound_nodes": [[["BN5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_752", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_752", "inbound_nodes": [[["MaxPool2D3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv6", "inbound_nodes": [[["dropout_752", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN6", "inbound_nodes": [[["Conv6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv7", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv7", "inbound_nodes": [[["BN6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN7", "inbound_nodes": [[["Conv7", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2D4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "MaxPool2D4", "inbound_nodes": [[["BN7", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_753", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_753", "inbound_nodes": [[["MaxPool2D4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv8", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv8", "inbound_nodes": [[["dropout_753", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN8", "inbound_nodes": [[["Conv8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv9", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv9", "inbound_nodes": [[["BN8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN9", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN9", "inbound_nodes": [[["Conv9", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2D5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "MaxPool2D5", "inbound_nodes": [[["BN9", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_754", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_754", "inbound_nodes": [[["MaxPool2D5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv10", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv10", "inbound_nodes": [[["dropout_754", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN10", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN10", "inbound_nodes": [[["Conv10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv11", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv11", "inbound_nodes": [[["BN10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN11", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN11", "inbound_nodes": [[["Conv11", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2D6", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "name": "MaxPool2D6", "inbound_nodes": [[["BN11", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_755", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_755", "inbound_nodes": [[["MaxPool2D6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1x1", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1x1", "inbound_nodes": [[["dropout_755", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_125", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_125", "inbound_nodes": [[["1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_125", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_125", "inbound_nodes": [[["global_average_pooling2d_125", 0, 0, {}]]]}], "input_layers": [["input_126", 0, 0]], "output_layers": [["activation_125", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "1x1/kernel", "shape": [1, 1, 128, 24], "dtype": "float32"}, {"name": "1x1/bias", "shape": [24], "dtype": "float32"}, {"name": "BN0/gamma", "shape": [16], "dtype": "float32"}, {"name": "BN0/beta", "shape": [16], "dtype": "float32"}, {"name": "BN0/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "BN0/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "BN1/gamma", "shape": [16], "dtype": "float32"}, {"name": "BN1/beta", "shape": [16], "dtype": "float32"}, {"name": "BN1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "BN1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "BN10/gamma", "shape": [128], "dtype": "float32"}, {"name": "BN10/beta", "shape": [128], "dtype": "float32"}, {"name": "BN10/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "BN10/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "BN11/gamma", "shape": [128], "dtype": "float32"}, {"name": "BN11/beta", "shape": [128], "dtype": "float32"}, {"name": "BN11/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "BN11/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "BN2/gamma", "shape": [32], "dtype": "float32"}, {"name": "BN2/beta", "shape": [32], "dtype": "float32"}, {"name": "BN2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "BN2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "BN3/gamma", "shape": [32], "dtype": "float32"}, {"name": "BN3/beta", "shape": [32], "dtype": "float32"}, {"name": "BN3/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "BN3/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "BN4/gamma", "shape": [64], "dtype": "float32"}, {"name": "BN4/beta", "shape": [64], "dtype": "float32"}, {"name": "BN4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "BN4/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "BN5/gamma", "shape": [64], "dtype": "float32"}, {"name": "BN5/beta", "shape": [64], "dtype": "float32"}, {"name": "BN5/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "BN5/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "BN6/gamma", "shape": [64], "dtype": "float32"}, {"name": "BN6/beta", "shape": [64], "dtype": "float32"}, {"name": "BN6/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "BN6/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "BN7/gamma", "shape": [64], "dtype": "float32"}, {"name": "BN7/beta", "shape": [64], "dtype": "float32"}, {"name": "BN7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "BN7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "BN8/gamma", "shape": [128], "dtype": "float32"}, {"name": "BN8/beta", "shape": [128], "dtype": "float32"}, {"name": "BN8/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "BN8/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "BN9/gamma", "shape": [128], "dtype": "float32"}, {"name": "BN9/beta", "shape": [128], "dtype": "float32"}, {"name": "BN9/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "BN9/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Conv0/kernel", "shape": [5, 1, 1, 16], "dtype": "float32"}, {"name": "Conv0/bias", "shape": [16], "dtype": "float32"}, {"name": "Conv1/kernel", "shape": [3, 1, 16, 16], "dtype": "float32"}, {"name": "Conv1/bias", "shape": [16], "dtype": "float32"}, {"name": "Conv10/kernel", "shape": [5, 1, 128, 128], "dtype": "float32"}, {"name": "Conv10/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv11/kernel", "shape": [3, 1, 128, 128], "dtype": "float32"}, {"name": "Conv11/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv2/kernel", "shape": [5, 1, 16, 32], "dtype": "float32"}, {"name": "Conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "Conv3/kernel", "shape": [3, 1, 32, 32], "dtype": "float32"}, {"name": "Conv3/bias", "shape": [32], "dtype": "float32"}, {"name": "Conv4/kernel", "shape": [5, 1, 32, 64], "dtype": "float32"}, {"name": "Conv4/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv5/kernel", "shape": [3, 1, 64, 64], "dtype": "float32"}, {"name": "Conv5/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv6/kernel", "shape": [5, 1, 64, 64], "dtype": "float32"}, {"name": "Conv6/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv7/kernel", "shape": [3, 1, 64, 64], "dtype": "float32"}, {"name": "Conv7/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv8/kernel", "shape": [5, 1, 64, 128], "dtype": "float32"}, {"name": "Conv8/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv9/kernel", "shape": [3, 1, 128, 128], "dtype": "float32"}, {"name": "Conv9/bias", "shape": [128], "dtype": "float32"}]}]}